app/controllers/home_controller.rb

SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT 1  [["name", "Escort"]]
SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = $1  ORDER BY "subcategories"."id" ASC LIMIT 6  [["category_id", 1]]
---
  def index
    @cat=Category.all
  	@cat1 = Category.find_by_name("Escort")
    p"-----#{@cat1}"
  	@cat2 = Category.find_by_name("Massage parlour")
    @cat3 = Category.find_by_name("Strip Club")
  	@escorts = @cat1.subcategories.first(6)