app/controllers/subcategories_controller.rb

	def show
		@subcat=Subcategory.find_by_id(params[:id])
  	# @subcat.images.present? ? @images = @subcat.images.pluck(:name) :  @images = ["/assets/club1.jpg","/assets/club2.jpg","/assets/club3.jpg","/assets/club1.jpg"]
		if @subcat.category.name=="escort"
			@imgs = @subcat.images.pluck(:name)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."id" = $1 LIMIT 1  [["id", 1885]]
SELECT "images"."name" FROM "images" WHERE "images"."subcategory_id" = $1  [["subcategory_id", 1885]]

	def find_subcategory
		if params[:subcategory_id].present?
			@subcategory = Subcategory.find_by_id(params[:subcategory_id])
			if @subcategory
				@imgs = []
					if @subcategory.category.name=="escort"
						@subcategory.images.each do |i|
---
SELECT "categories".* FROM "categories"